{
    "GroupedRecords": {
        "properties": {
            "length": {
                "comment": {
                    "shortText": "Gets or sets the length of the array. This is a number one higher than the highest element defined in an array."
                }
            }
        },
        "methods": {
            "toString": {
                "comment": {
                    "shortText": "Returns a string representation of an array."
                }
            },
            "toLocaleString": {
                "comment": {
                    "shortText": "Returns a string representation of an array. The elements are converted to string using their toLocalString methods."
                }
            },
            "pop": {
                "comment": {
                    "shortText": "Removes the last element from an array and returns it."
                }
            },
            "push": {
                "comment": {
                    "parameters": {
                        "items": {
                            "comment": {
                                "text": "New elements of the Array."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Appends new elements to an array, and returns the new length of the array."
                }
            },
            "concat": {
                "comment": {
                    "parameters": {
                        "items": {
                            "comment": {
                                "text": "Additional items to add to the end of array1."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Combines two or more arrays."
                }
            },
            "join": {
                "comment": {
                    "parameters": {
                        "separator": {
                            "comment": {
                                "text": "A string used to separate one element of an array from the next in the resulting String. If omitted, the array elements are separated with a comma."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Adds all the elements of an array separated by the specified separator string."
                }
            },
            "reverse": {
                "comment": {
                    "shortText": "Reverses the elements in an Array."
                }
            },
            "shift": {
                "comment": {
                    "shortText": "Removes the first element from an array and returns it."
                }
            },
            "slice": {
                "comment": {
                    "parameters": {
                        "start": {
                            "comment": {
                                "text": "The beginning of the specified portion of the array."
                            }
                        },
                        "end": {
                            "comment": {
                                "text": "The end of the specified portion of the array."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Returns a section of an array."
                }
            },
            "sort": {
                "comment": {
                    "parameters": {
                        "compareFn": {
                            "comment": {
                                "text": "The name of the function used to determine the order of the elements. If omitted, the elements are sorted in ascending, ASCII character order."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Sorts an array."
                }
            },
            "splice": {
                "comment": {
                    "parameters": {
                        "start": {
                            "comment": {
                                "text": "The zero-based location in the array from which to start removing elements."
                            }
                        },
                        "deleteCount": {
                            "comment": {
                                "text": "The number of elements to remove."
                            }
                        },
                        "items": {
                            "comment": {
                                "text": "Elements to insert into the array in place of the deleted elements."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Removes elements from an array and, if necessary, inserts new elements in their place, returning the deleted elements."
                }
            },
            "unshift": {
                "comment": {
                    "parameters": {
                        "items": {
                            "comment": {
                                "text": "Elements to insert at the start of the Array."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Inserts new elements at the start of an array."
                }
            },
            "indexOf": {
                "comment": {
                    "parameters": {
                        "searchElement": {
                            "comment": {
                                "text": "The value to locate in the array."
                            }
                        },
                        "fromIndex": {
                            "comment": {
                                "text": "The array index at which to begin the search. If fromIndex is omitted, the search starts at index 0."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Returns the index of the first occurrence of a value in an array."
                }
            },
            "lastIndexOf": {
                "comment": {
                    "parameters": {
                        "searchElement": {
                            "comment": {
                                "text": "The value to locate in the array."
                            }
                        },
                        "fromIndex": {
                            "comment": {
                                "text": "The array index at which to begin the search. If fromIndex is omitted, the search starts at the last index in the array."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Returns the index of the last occurrence of a specified value in an array."
                }
            },
            "every": {
                "comment": {
                    "parameters": {
                        "callbackfn": {
                            "comment": {
                                "text": "A function that accepts up to three arguments. The every method calls the callbackfn function for each element in array1 until the callbackfn returns false, or until the end of the array."
                            }
                        },
                        "thisArg": {
                            "comment": {
                                "text": "An object to which the this keyword can refer in the callbackfn function. If thisArg is omitted, undefined is used as the this value."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Determines whether all the members of an array satisfy the specified test."
                }
            },
            "some": {
                "comment": {
                    "parameters": {
                        "callbackfn": {
                            "comment": {
                                "text": "A function that accepts up to three arguments. The some method calls the callbackfn function for each element in array1 until the callbackfn returns true, or until the end of the array."
                            }
                        },
                        "thisArg": {
                            "comment": {
                                "text": "An object to which the this keyword can refer in the callbackfn function. If thisArg is omitted, undefined is used as the this value."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Determines whether the specified callback function returns true for any element of an array."
                }
            },
            "forEach": {
                "comment": {
                    "parameters": {
                        "callbackfn": {
                            "comment": {
                                "text": "A function that accepts up to three arguments. forEach calls the callbackfn function one time for each element in the array."
                            }
                        },
                        "thisArg": {
                            "comment": {
                                "text": "An object to which the this keyword can refer in the callbackfn function. If thisArg is omitted, undefined is used as the this value."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Performs the specified action for each element in an array."
                }
            },
            "map": {
                "comment": {
                    "parameters": {
                        "callbackfn": {
                            "comment": {
                                "text": "A function that accepts up to three arguments. The map method calls the callbackfn function one time for each element in the array."
                            }
                        },
                        "thisArg": {
                            "comment": {
                                "text": "An object to which the this keyword can refer in the callbackfn function. If thisArg is omitted, undefined is used as the this value."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Calls a defined callback function on each element of an array, and returns an array that contains the results."
                }
            },
            "filter": {
                "comment": {
                    "parameters": {
                        "callbackfn": {
                            "comment": {
                                "text": "A function that accepts up to three arguments. The filter method calls the callbackfn function one time for each element in the array."
                            }
                        },
                        "thisArg": {
                            "comment": {
                                "text": "An object to which the this keyword can refer in the callbackfn function. If thisArg is omitted, undefined is used as the this value."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Returns the elements of an array that meet the condition specified in a callback function."
                }
            },
            "reduce": {
                "comment": {
                    "parameters": {
                        "callbackfn": {
                            "comment": {
                                "text": "A function that accepts up to four arguments. The reduce method calls the callbackfn function one time for each element in the array."
                            }
                        },
                        "initialValue": {
                            "comment": {
                                "text": "If initialValue is specified, it is used as the initial value to start the accumulation. The first call to the callbackfn function provides this value as an argument instead of an array value."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Calls the specified callback function for all the elements in an array. The return value of the callback function is the accumulated result, and is provided as an argument in the next call to the callback function."
                }
            },
            "reduceRight": {
                "comment": {
                    "parameters": {
                        "callbackfn": {
                            "comment": {
                                "text": "A function that accepts up to four arguments. The reduceRight method calls the callbackfn function one time for each element in the array."
                            }
                        },
                        "initialValue": {
                            "comment": {
                                "text": "If initialValue is specified, it is used as the initial value to start the accumulation. The first call to the callbackfn function provides this value as an argument instead of an array value."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Calls the specified callback function for all the elements in an array, in descending order. The return value of the callback function is the accumulated result, and is provided as an argument in the next call to the callback function."
                }
            },
            "find": {
                "comment": {
                    "parameters": {
                        "predicate": {
                            "comment": {
                                "text": [
                                    "find calls predicate once for each element of the array, in ascending",
                                    "order, until it finds one where predicate returns true. If such an element is found, find",
                                    "immediately returns that element value. Otherwise, find returns undefined."
                                ]
                            }
                        },
                        "thisArg": {
                            "comment": {
                                "text": [
                                    "If provided, it will be used as the this value for each invocation of",
                                    "predicate. If it is not provided, undefined is used instead."
                                ]
                            }
                        }
                    },
                    "tags": {},
                    "shortText": [
                        "Returns the value of the first element in the array where predicate is true, and undefined",
                        "otherwise."
                    ]
                }
            },
            "findIndex": {
                "comment": {
                    "parameters": {
                        "predicate": {
                            "comment": {
                                "text": [
                                    "find calls predicate once for each element of the array, in ascending",
                                    "order, until it finds one where predicate returns true. If such an element is found,",
                                    "findIndex immediately returns that element index. Otherwise, findIndex returns -1."
                                ]
                            }
                        },
                        "thisArg": {
                            "comment": {
                                "text": [
                                    "If provided, it will be used as the this value for each invocation of",
                                    "predicate. If it is not provided, undefined is used instead."
                                ]
                            }
                        }
                    },
                    "tags": {},
                    "shortText": [
                        "Returns the index of the first element in the array where predicate is true, and -1",
                        "otherwise."
                    ]
                }
            },
            "fill": {
                "comment": {
                    "parameters": {
                        "value": {
                            "comment": {
                                "text": "value to fill array section with"
                            }
                        },
                        "start": {
                            "comment": {
                                "text": [
                                    "index to start filling the array at. If start is negative, it is treated as",
                                    "length+start where length is the length of the array."
                                ]
                            }
                        },
                        "end": {
                            "comment": {
                                "text": [
                                    "index to stop filling the array at. If end is negative, it is treated as",
                                    "length+end."
                                ]
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Returns the this object after filling the section identified by start and end with value"
                }
            },
            "copyWithin": {
                "comment": {
                    "parameters": {
                        "target": {
                            "comment": {
                                "text": [
                                    "If target is negative, it is treated as length+target where length is the",
                                    "length of the array."
                                ]
                            }
                        },
                        "start": {
                            "comment": {
                                "text": [
                                    "If start is negative, it is treated as length+start. If end is negative, it",
                                    "is treated as length+end."
                                ]
                            }
                        },
                        "end": {
                            "comment": {
                                "text": "If not specified, length of the this object is used as its default value."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": [
                        "Returns the this object after copying a section of the array identified by start and end",
                        "to the same array starting at position target"
                    ]
                }
            },
            "__@iterator": {
                "comment": {
                    "shortText": "Iterator"
                }
            },
            "entries": {
                "comment": {
                    "shortText": "Returns an iterable of key, value pairs for every entry in the array"
                }
            },
            "keys": {
                "comment": {
                    "shortText": "Returns an iterable of keys in the array"
                }
            },
            "values": {
                "comment": {
                    "shortText": "Returns an iterable of values in the array"
                }
            },
            "__@unscopables": {
                "comment": {
                    "shortText": [
                        "Returns an object whose properties have the value 'true'",
                        "when they will be absent when used in a 'with' statement."
                    ]
                }
            },
            "includes": {
                "comment": {
                    "parameters": {
                        "searchElement": {
                            "comment": {
                                "text": "The element to search for."
                            }
                        },
                        "fromIndex": {
                            "comment": {
                                "text": "The position in this array at which to begin searching for searchElement."
                            }
                        }
                    },
                    "tags": {},
                    "shortText": "Determines whether an array includes a certain element, returning true or false as appropriate."
                }
            }
        },
        "accessors": {}
    }
}