{
    "GroupedRecords": {
        "properties": {
            "length": {
                "comment": {
                    "shortText": [
                        "Gets or sets the length of the array. This is a number one higher than the highest element defined in an array."
                    ]
                }
            }
        },
        "methods": {
            "includes": {
                "comment": {
                    "shortText": [
                        "Determines whether an array includes a certain element, returning true or false as appropriate."
                    ]
                }
            },
            "toString": {
                "comment": {
                    "shortText": [
                        "Returns a string representation of an array."
                    ]
                }
            },
            "toLocaleString": {
                "comment": {
                    "shortText": [
                        "Returns a string representation of an array. The elements are converted to string using thier toLocalString methods."
                    ]
                }
            },
            "push": {
                "comment": {
                    "shortText": [
                        "Appends new elements to an array, and returns the new length of the array."
                    ]
                }
            },
            "pop": {
                "comment": {
                    "shortText": [
                        "Removes the last element from an array and returns it."
                    ]
                }
            },
            "concat": {
                "comment": {
                    "shortText": [
                        "Combines two or more arrays."
                    ]
                }
            },
            "join": {
                "comment": {
                    "shortText": [
                        "Adds all the elements of an array separated by the specified separator string."
                    ]
                }
            },
            "reverse": {
                "comment": {
                    "shortText": [
                        "Reverses the elements in an Array."
                    ]
                }
            },
            "shift": {
                "comment": {
                    "shortText": [
                        "Removes the first element from an array and returns it."
                    ]
                }
            },
            "slice": {
                "comment": {
                    "shortText": [
                        "Returns a section of an array."
                    ]
                }
            },
            "sort": {
                "comment": {
                    "shortText": [
                        "Sorts an array."
                    ]
                }
            },
            "splice": {
                "comment": {
                    "shortText": [
                        "Removes elements from an array and, if necessary, inserts new elements in their place, returning the deleted elements."
                    ]
                }
            },
            "unshift": {
                "comment": {
                    "shortText": [
                        "Inserts new elements at the start of an array."
                    ]
                }
            },
            "indexOf": {
                "comment": {
                    "shortText": [
                        "Returns the index of the first occurrence of a value in an array."
                    ]
                }
            },
            "lastIndexOf": {
                "comment": {
                    "shortText": [
                        "Returns the index of the last occurrence of a specified value in an array."
                    ]
                }
            },
            "every": {
                "comment": {
                    "shortText": [
                        "Determines whether all the members of an array satisfy the specified test."
                    ]
                }
            },
            "some": {
                "comment": {
                    "shortText": [
                        "Determines whether the specified callback function returns true for any element of an array."
                    ]
                }
            },
            "forEach": {
                "comment": {
                    "shortText": [
                        "Performs the specified action for each element in an array."
                    ]
                }
            },
            "map": {
                "comment": {
                    "shortText": [
                        "Calls a defined callback function on each element of an array, and returns an array that contains the results."
                    ]
                }
            },
            "filter": {
                "comment": {
                    "shortText": [
                        "Returns the elements of an array that meet the condition specified in a callback function."
                    ]
                }
            },
            "reduce": {
                "comment": {
                    "shortText": [
                        "Calls the specified callback function for all the elements in an array. The return value of the callback function is the accumulated result, and is provided as an argument in the next call to the callback function."
                    ]
                }
            },
            "reduceRight": {
                "comment": {
                    "shortText": [
                        "Calls the specified callback function for all the elements in an array, in descending order. The return value of the callback function is the accumulated result, and is provided as an argument in the next call to the callback function."
                    ]
                }
            },
            "__@unscopables": {
                "comment": {
                    "shortText": [
                        "Returns an object whose properties have the value 'true'",
                        "when they will be absent when used in a 'with' statement."
                    ]
                }
            },
            "__@iterator": {
                "comment": {
                    "shortText": [
                        "Iterator"
                    ]
                }
            },
            "entries": {
                "comment": {
                    "shortText": [
                        "Returns an iterable of key, value pairs for every entry in the array"
                    ]
                }
            },
            "keys": {
                "comment": {
                    "shortText": [
                        "Returns an iterable of keys in the array"
                    ]
                }
            },
            "values": {
                "comment": {
                    "shortText": [
                        "Returns an iterable of values in the array"
                    ]
                }
            },
            "find": {
                "comment": {
                    "shortText": [
                        "Returns the value of the first element in the array where predicate is true, and undefined",
                        "otherwise."
                    ]
                }
            },
            "findIndex": {
                "comment": {
                    "shortText": [
                        "Returns the index of the first element in the array where predicate is true, and -1",
                        "otherwise."
                    ]
                }
            },
            "fill": {
                "comment": {
                    "shortText": [
                        "Returns the this object after filling the section identified by start and end with value"
                    ]
                }
            },
            "copyWithin": {
                "comment": {
                    "shortText": [
                        "Returns the this object after copying a section of the array identified by start and end",
                        "to the same array starting at position target"
                    ]
                }
            }
        },
        "accessors": {},
        "functions": {}
    }
}